{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_Possible_theft_of_passwords_and_other_sensitive_web_browser_information_T1003_T1005_T1119_T1539_T1550_004_T1552_001_T1555_003_T1555_004')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - Possible theft of passwords and other sensitive web browser information",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"Possible theft of passwords and other sensitive web browser information\"\n| where MitreTechnique == \"T1003;T1005;T1119;T1539;T1550.004;T1552.001;T1555.003;T1555.004\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - Possible theft of passwords and other sensitive web browser information - Mitre Techniques T1003,T1005,T1119,T1539,T1550.004,T1552.001,T1555.003,T1555.004"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
		  {
            "name": "techniques",
            "value": "T1003,T1005,T1119,T1539,T1550.004,T1552.001,T1555.003,T1555.004"
          }
        ]
      }
    }
  ]
}