{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_Use_of_living_off_the_land_binary_to_run_malicious_code')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - Use of living-off-the-land binary to run malicious code",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where MitreTechnique == \"T1105;T1140;T1216;T1218;T1218.003;T1218.004;T1218.005;T1218.010;T1218.011;T1220\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - Use of living-off-the-land binary to run malicious code - Attackers attempt to run malicious code undetected by loading the code in the context of common executables. Security researchers refer to this approach and a few other evasive techniques as living off the land” (LOL) and the common executables as LOL binaries or LOLBins”.  This alert indicates an anomalous attempt by a parent process to run one of these common executables using suspicious command-line parameters."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
		  {
            "name": "techniques",
            "value": "T1105,T1140,T1216,T1218,T1218.003,T1218.004,T1218.005,T1218.010,T1218.011,T1220"
          }
        ]
      }
    }
  ]
}