{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_A_WMI_event_filter_was_bound_to_a_suspicious_event_consumer_T1546_003')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - A WMI event filter was bound to a suspicious event consumer",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"A WMI event filter was bound to a suspicious event consumer\"\n| where MitreTechnique == \"T1546.003\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - A WMI event filter was bound to a suspicious event consumer - Mitre Techniques T1546.003"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
		  {
            "name": "techniques",
            "value": "T1546.003"
          }
        ]
      }
    }
  ]
}