{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_Malicious_credential_theft_tool_execution_detected_T1003')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - Malicious credential theft tool execution detected",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"Malicious credential theft tool execution detected\"\n| where MitreTechnique == \"T1003\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - Malicious credential theft tool execution detected - Mitre Techniques T1003"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
		  {
            "name": "techniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}