{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_System_executable_renamed_and_launched')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - System executable renamed and launched",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"System executable renamed and launched\"\n| where MitreTechnique == \"T1036;T1036.003\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - System executable renamed and launched"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
		  {
            "name": "techniques",
            "value": "T1036,T1036.003"
          }
        ]
      }
    }
  ]
}