{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_Process_execution_from_an_alternate_data_stream_(ADS)_T1564_004')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - Process execution from an alternate data stream (ADS)",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"Process execution from an alternate data stream (ADS)\"\n| where MitreTechnique == \"T1564.004\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - Process execution from an alternate data stream (ADS) - Mitre Techniques T1564.004"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
		  {
            "name": "techniques",
            "value": "T1564.004"
          }
        ]
      }
    }
  ]
}