{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_Suspicious_System_Hardware_Discovery_T1047_T1082_T1497_001')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - Suspicious System Hardware Discovery",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"Suspicious System Hardware Discovery\"\n| where MitreTechnique == \"T1047;T1082;T1497.001\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - Suspicious System Hardware Discovery - Mitre Techniques T1047,T1082,T1497.001"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          },
		  {
            "name": "techniques",
            "value": "T1047,T1082,T1497.001"
          }
        ]
      }
    }
  ]
}