{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_Suspicious_service_registration_T1036_T1543_003_T1569_002_T1574_011')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - Suspicious service registration",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"Suspicious service registration\"\n| where MitreTechnique == \"T1036;T1543.003;T1569.002;T1574.011\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - Suspicious service registration - Mitre Techniques T1036,T1543.003,T1569.002,T1574.011"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
		  {
            "name": "techniques",
            "value": "T1036,T1543.003,T1569.002,T1574.011"
          }
        ]
      }
    }
  ]
}