{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_Possible_command-and-control_activity_T1071')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - Possible command-and-control activity",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"Possible command-and-control activity\"\n| where MitreTechnique == \"T1071\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - Possible command-and-control activity - Mitre Techniques T1071"
          },
          {
            "name": "tactics",
            "value": "CommandAndControl"
          },
		  {
            "name": "techniques",
            "value": "T1071"
          }
        ]
      }
    }
  ]
}