{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_T1059.003_Suspicious_behavior_by_cmd.exe_was_observed')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - T1059.003 - Suspicious behavior by cmd.exe was observed",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where MitreTechnique == \"T1059.003\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert Generated for T1059.003 - Suspicious behavior by cmd.exe was observed - A suspicious behavior by cmd.exe was observed. This behavior may indicate malware installation or other malicious activities on the machine."
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
		  {
            "name": "techniques",
            "value": "T1059.003"
          }
        ]
      }
    }
  ]
}