{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_A_user_was_added_to_an_administrative_group_T1098')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - A user was added to an administrative group",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"A user was added to an administrative group\"\n| where MitreTechnique == \"T1098\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - A user was added to an administrative group - Mitre Techniques T1098"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
		  {
            "name": "techniques",
            "value": "T1098"
          }
        ]
      }
    }
  ]
}